In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

df2 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5'],
    'D': ['D3', 'D4', 'D5']},
    index=[3, 4, 5])

In [3]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [4]:
df2

    A   B   C   D
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [5]:
#df12a0=pd.concat([df1,df2]) #default:axis=0
df12a0=pd.concat([df1,df2],axis=0)
df12a0

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [6]:
df3 = pd.DataFrame({'E': ['A6', 'A7', 'A8'],
    'F': ['B6', 'B7', 'B8'],
    'G': ['C6', 'C7', 'C8'],
    'H': ['D6', 'D7', 'D8']},
    index=[0, 1, 2])

df4 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'E': ['E0', 'E1', 'E2']},
     index=[0, 1, 3])

In [7]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [8]:
df3

    E   F   G   H
0  A6  B6  C6  D6
1  A7  B7  C7  D7
2  A8  B8  C8  D8

In [9]:
#pd.concat([df1,df3]) axis=0이 기본값
df13a1=pd.concat([df1,df3],axis=1)

In [10]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [11]:
df4

    A   B   C   E
0  A0  B0  C0  E0
1  A1  B1  C1  E1
3  A2  B2  C2  E2

In [12]:
df14o=pd.concat([df1,df4])#join=outer(default)

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [13]:
df14i=pd.concat([df1,df4], join='inner')
df14i

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A0  B0  C0
1  A1  B1  C1
3  A2  B2  C2

In [14]:
df14o1=pd.concat([df1,df4],axis=1,join='outer')

In [15]:
df14i1=pd.concat([df1,df4],axis=1,join='inner')

In [16]:
df14ja1=pd.concat([df1,df4],axis=1, join_axes=[df1.index])

In [17]:
df14ja1

    A   B   C   D    A    B    C    E
0  A0  B0  C0  D0   A0   B0   C0   E0
1  A1  B1  C1  D1   A1   B1   C1   E1
2  A2  B2  C2  D2  NaN  NaN  NaN  NaN

In [18]:
df5 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])
df6 = pd.DataFrame({'A': ['A3', 'A4', 'A5'],
     'B': ['B3', 'B4', 'B5'],
     'C': ['C3', 'C4', 'C5'],
     'D': ['D3', 'D4', 'D5']},
     index=['r3', 'r4', 'r5'])

In [19]:
df5

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [20]:
df6

     A   B   C   D
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4
r5  A5  B5  C5  D5

In [21]:
pd.concat([df5,df6]) #ignore_index=False(default)

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4
r5  A5  B5  C5  D5

In [22]:
pd.concat([df5,df6], ignore_index=True)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5

In [23]:
#keys=계층적 index를 구성
df56wk=pd.concat([df5,df6], keys=['df5','df6'])
df56wk

         A   B   C   D
df5 r0  A0  B0  C0  D0
    r1  A1  B1  C1  D1
    r2  A2  B2  C2  D2
df6 r3  A3  B3  C3  D3
    r4  A4  B4  C4  D4
    r5  A5  B5  C5  D5

In [24]:
df56wk.ix['df5']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [25]:
df56wk.ix['df5'][0:2]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1

In [26]:
pd.concat([df5,df6], keys=['df5','df6'], names=['dfname', 'rownum'])

                A   B   C   D
dfname rownum
df5    r0      A0  B0  C0  D0
       r1      A1  B1  C1  D1
       r2      A2  B2  C2  D2
df6    r3      A3  B3  C3  D3
       r4      A4  B4  C4  D4
       r5      A5  B5  C5  D5

In [27]:
df7 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
     'B': ['B0', 'B1', 'B2'],
     'C': ['C0', 'C1', 'C2'],
     'D': ['D0', 'D1', 'D2']},
     index=['r0', 'r1', 'r2'])
df8 = pd.DataFrame({'A': ['A2', 'A3', 'A4'],
     'B': ['B2', 'B3', 'B4'],
     'C': ['C2', 'C3', 'C4'],
     'D': ['D2', 'D3', 'D4']},
     index=['r2', 'r3', 'r4'])

In [28]:
df7

     A   B   C   D
r0  A0  B0  C0  D0
r1  A1  B1  C1  D1
r2  A2  B2  C2  D2

In [29]:
df8

     A   B   C   D
r2  A2  B2  C2  D2
r3  A3  B3  C3  D3
r4  A4  B4  C4  D4

In [52]:
pd.concat([df7, df8],verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['r2'], dtype='object')

In [30]:
# concat(), append() : 데이터 프레임 + 시리즈 합치기 => 데이터프레임
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2'],
    'D': ['D0', 'D1', 'D2']},
    index=[0, 1, 2])

In [31]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2

In [35]:
ser=pd.Series(['s1','s2','s3'], name='E')
ser

0    s1
1    s2
2    s3
Name: E, dtype: object

In [36]:
pd.concat([df1, ser], axis=1)
# 위아래로 합쳐지는작업수행
# 좌우로 합펴지는 작업수행

    A   B   C   D   E
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [37]:
pd.concat([df1,ser], axis=1, ignore_index=True)

    0   1   2   3   4
0  A0  B0  C0  D0  s1
1  A1  B1  C1  D1  s2
2  A2  B2  C2  D2  s3

In [40]:
s1=pd.Series([3,4,5])
s2=pd.Series([3,4,5])
s3=pd.Series([3,4,5])

In [41]:
pd.concat([s1,s2,s3])

0    3
1    4
2    5
0    3
1    4
2    5
0    3
1    4
2    5
dtype: int64

In [42]:
pd.concat([s1,s2,s3],axis=1, keys=['c1','c2','c3'])

   c1  c2  c3
0   3   3   3
1   4   4   4
2   5   5   5

In [43]:
# merge : df 합치는 작업수행 (= concat함수)
# left outer inner join 등의 다양한 형태로 병합이 가능하다
# merge - how(left, outer, inner(기본값) - on 

dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})
dfleft
dfright

  KEY   C   D
0  K2  C2  D2
1  K3  C3  D3
2  K4  C4  D4
3  K5  C5  D5

In [46]:
# KEY column이 동일하다. 이를기준으로 병합한다. 
dfmhr=pd.merge(dfleft,dfright,on='KEY',how='left')
# merge : 좀더 상세하고 디테일한 지정가능

  KEY   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1  NaN  NaN
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [47]:
pd.merge(dfleft,dfright,on='KEY',how='inner')

  KEY   A   B   C   D
0  K2  A2  B2  C2  D2
1  K3  A3  B3  C3  D3

In [48]:
pd.merge(dfleft,dfright,on='KEY',how='outer')

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [50]:
# 인덱스르 통해서도  
dfleft = pd.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']},
    index=['KO', 'K1', 'K2', 'K3'])


dfright = pd.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']},
    index=['K2', 'K3', 'K4', 'K5'])
dfleft
dfright

   KEY   C   D
K2  K2  C2  D2
K3  K3  C3  D3
K4  K4  C4  D4
K5  K5  C5  D5

In [51]:
pd.merge(dfleft,dfright,left_index=True,right_index=True)

   KEY_x   A   B KEY_y   C   D
K2    K2  A2  B2    K2  C2  D2
K3    K3  A3  B3    K3  C3  D3

In [55]:
dfleft = np.DataFrame({'KEY': ['K0', 'K1', 'K2', 'K3'],
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3']})


dfright = mp.DataFrame({'KEY': ['K2', 'K3', 'K4', 'K5'],
    'C': ['C2', 'C3', 'C4', 'C5'],
    'D': ['D2', 'D3', 'D4', 'D5']})

AttributeError: module 'numpy' has no attribute 'DataFrame'

In [59]:
dfa=pd.merge(dfleft,dfright,on='KEY',how='outer')

In [60]:
dfa

  KEY    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1  NaN  NaN
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C4   D4
5  K5  NaN  NaN   C5   D5

In [73]:
pd.isnull(dfa)

     KEY      A      B      C      D
0  False   True   True   True   True
1  False   True   True   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [74]:
dfa.isnull()

     KEY      A      B      C      D
0  False   True   True   True   True
1  False   True   True   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [75]:
pd.notnull(dfa)

    KEY      A      B      C      D
0  True  False  False  False  False
1  True  False  False  False  False
2  True   True   True   True   True
3  True   True   True   True   True
4  True  False  False   True   True
5  True  False  False   True   True

In [76]:
dfa.ix[0,'B']

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [77]:
dfa.ix[[0,1],['A','B']]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

      A     B
0  None  None
1  None  None

In [78]:
dfa.ix[[0,1],['A','B']]=None
# None = NA

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [79]:
dfa

  KEY     A     B    C    D
0  K0  None  None  NaN  NaN
1  K1  None  None  NaN  NaN
2  K2    A2    B2   C2   D2
3  K3    A3    B3   C3   D3
4  K4   NaN   NaN   C4   D4
5  K5   NaN   NaN   C5   D5

In [80]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
KEY    6 non-null object
A      2 non-null object
B      2 non-null object
C      4 non-null object
D      4 non-null object
dtypes: object(5)
memory usage: 448.0+ bytes

In [81]:
dfa.isnull()

     KEY      A      B      C      D
0  False   True   True   True   True
1  False   True   True   True   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False   True   True  False  False
5  False   True   True  False  False

In [82]:
dfa.isnull().sum() 
# 전체컬럼에 대해 널값이 몇개냐 [중요구문]

KEY    0
A      4
B      4
C      2
D      2
dtype: int64

In [83]:
dfa['A'].isnull().sum()

4

In [85]:
dfa.notnull().sum()

KEY    6
A      2
B      2
C      4
D      4
dtype: int64

In [86]:
dfa.isnull().sum(1)

0    4
1    4
2    0
3    0
4    2
5    2
dtype: int64

In [87]:
dfa['NaN_Num']=dfa.isnull().sum(1)

In [88]:
dfa

  KEY     A     B    C    D  NaN_Num
0  K0  None  None  NaN  NaN        4
1  K1  None  None  NaN  NaN        4
2  K2    A2    B2   C2   D2        0
3  K3    A3    B3   C3   D3        0
4  K4   NaN   NaN   C4   D4        2
5  K5   NaN   NaN   C5   D5        2

In [89]:
dfa['NotNaN_Num']=dfa.notnull().sum(1)
dfa

  KEY     A     B    C    D  NaN_Num  NotNaN_Num
0  K0  None  None  NaN  NaN        4           2
1  K1  None  None  NaN  NaN        4           2
2  K2    A2    B2   C2   D2        0           6
3  K3    A3    B3   C3   D3        0           6
4  K4   NaN   NaN   C4   D4        2           4
5  K5   NaN   NaN   C5   D5        2           4

In [90]:
df=pd.DataFrame(np.arange(10).reshape(5,2),
               columns=['c1','c2'],
               index=['a','b','c','d','e'])
df

   c1  c2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [95]:
# b,e행 c1열에 None, b,c행 c2열 None 대입
df.ix[['b','e'],['c1']]=None
df.ix[['b','c'],['c2']]=None

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [96]:
df.sum()
df['c1'].sum()

10.0

In [97]:
df['c1'].cumsum() # Nan이 0으로취급

a     0.0
b     NaN
c     4.0
d    10.0
e     NaN
Name: c1, dtype: float64

In [100]:
df.mean() # Nan은 제외
df.mean(1)

a    0.5
b    NaN
c    4.0
d    6.5
e    9.0
dtype: float64

In [101]:
df.std()

c1    3.055050
c2    4.163332
dtype: float64

In [102]:
df

    c1   c2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [103]:
df['c3']=df['c1']+df['c2']
df
# 데이터 프레임에서 컬럼간 연산시, 어느 하나라도 NaN이 존재하면 결과도 NaN이 됨

    c1   c2    c3
a  0.0  1.0   1.0
b  NaN  NaN   NaN
c  4.0  NaN   NaN
d  6.0  7.0  13.0
e  NaN  9.0   NaN

In [104]:
# 데이터프레임 생성

df=pd.DataFrame(np.random.randn(5,3),
            columns=['c1','c2','c3'])
df

         c1        c2        c3
0  0.911346 -0.048388  0.868274
1 -0.521457 -1.264463  0.589173
2  1.493208 -0.280241 -0.942279
3  0.487132 -1.182062  2.691880
4  0.502536 -0.448312  0.705112

In [105]:
df.ix[0]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

c1    0.911346
c2   -0.048388
c3    0.868274
Name: 0, dtype: float64

In [106]:
df.ix[0,0]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0.9113460838566466

In [107]:
df.ix[0,0]=None
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         c1        c2        c3
0       NaN -0.048388  0.868274
1 -0.521457 -1.264463  0.589173
2  1.493208 -0.280241 -0.942279
3  0.487132 -1.182062  2.691880
4  0.502536 -0.448312  0.705112

In [108]:
df.ix[1]

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

c1   -0.521457
c2   -1.264463
c3    0.589173
Name: 1, dtype: float64

In [110]:
df.ix[1,['c1','c3']]=np.nan
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

         c1        c2        c3
0       NaN -0.048388  0.868274
1       NaN -1.264463       NaN
2  1.493208 -0.280241 -0.942279
3  0.487132 -1.182062  2.691880
4  0.502536 -0.448312  0.705112

In [111]:
df.ix[2, 'c2']=np.nan
df.ix[3, 'c2']=np.nan
df.ix[4, 'c3']=np.nan
df

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

C:\Users\user\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

         c1        c2        c3
0       NaN -0.048388  0.868274
1       NaN -1.264463       NaN
2  1.493208       NaN -0.942279
3  0.487132       NaN  2.691880
4  0.502536 -0.448312       NaN

In [113]:
df.fillna(100)
df.fillna('missing')

         c1         c2        c3
0   missing -0.0483885  0.868274
1   missing   -1.26446   missing
2   1.49321    missing -0.942279
3  0.487132    missing   2.69188
4  0.502536  -0.448312   missing

In [115]:
df.fillna(method='ffill',limit=1)

         c1        c2        c3
0       NaN -0.048388  0.868274
1       NaN -1.264463  0.868274
2  1.493208 -1.264463 -0.942279
3  0.487132 -1.264463  2.691880
4  0.502536 -0.448312  2.691880

In [116]:
df.mean()

c1    0.827625
c2   -0.587054
c3    0.872625
dtype: float64

In [118]:
df.fillna(df.mean()['c1'])

         c1        c2        c3
0  0.827625 -0.048388  0.868274
1  0.827625 -1.264463  0.872625
2  1.493208 -0.587054 -0.942279
3  0.487132 -0.587054  2.691880
4  0.502536 -0.448312  0.872625

In [ ]:
df2=[pd.DataFrame({'a1':[1,2,3,4,5],
                'a2':[10,11,12,13,14])]
# a3열추가
# a2열이 NaN이면, a1열의 값으로 a3열을 채우고,
# a3: 10, 2, 12, 4, 14
 
df2['a3']=np.where(pd.notnull(df2['a2'])==True,df2['a2'],df2['a1'])